In [1]:
import numpy as np
import pandas as pd
import warnings
warnings.filterwarnings('ignore')
import pymysql
from sqlalchemy import create_engine

In [2]:
countries = pd.read_csv("NATMON_COUNTRY.csv")
countries_df = pd.DataFrame(countries)

In [3]:
countries_df.tail(3)

    COUNTRY_ID                   COUNTRY_NAME_EN
238        YEM                             Yemen
239        COD  Democratic Republic of the Congo
240        ZMB                            Zambia

In [4]:
metadata = pd.read_csv("NATMON_METADATA.csv")
metadata_df = pd.DataFrame(metadata)

In [5]:
metadata_df.shape

(111812, 5)

In [6]:
metadata_df.isnull().sum()

INDICATOR_ID    0
COUNTRY_ID      0
YEAR            0
TYPE            0
METADATA        0
dtype: int64

In [7]:
national = pd.read_csv("NATMON_DATA_NATIONAL.csv", low_memory=False)
national_df = pd.DataFrame(national)

In [8]:
national_df.shape

(2588761, 6)

In [9]:
national_df.tail(5)

               INDICATOR_ID COUNTRY_ID  YEAR     VALUE MAGNITUDE QUALIFIER
2588756  XSPENDP.FDPUB.FNTS        ZAF  2018  58.41285       NaN       NaN
2588757  XSPENDP.FDPUB.FNTS        ZAF  2019  57.46629       NaN       NaN
2588758  XSPENDP.FDPUB.FNTS        ZMB  2004  71.26970       NaN       NaN
2588759  XSPENDP.FDPUB.FNTS        ZMB  2015  71.58938       NaN       NaN
2588760  XSPENDP.FDPUB.FNTS        ZMB  2016  75.55357       NaN       NaN

In [10]:
label = pd.read_csv("NATMON_LABEL.csv")
label_df = pd.DataFrame(label)

In [11]:
label_df.tail()

              INDICATOR_ID                                 INDICATOR_LABEL_EN
1058   XSPENDP.FDPUB.FNCUR  Current expenditure as a percentage of total e...
1059  XSPENDP.FDPUB.FNNONS  Current expenditure other than staff compensat...
1060   XSPENDP.FDPUB.FNNTS  Non-teaching staff compensation as a percentag...
1061     XSPENDP.FDPUB.FNS  All staff compensation as a percentage of tota...
1062    XSPENDP.FDPUB.FNTS  Teaching staff compensation as a percentage of...

In [12]:
metadata_df.head()

,INDICATOR_ID,COUNTRY_ID,YEAR,TYPE,METADATA
0,MYS.1T8.AG25T99,ARG,2003,Under Coverage:Students or individuals,Urban areas only.
1,MYS.1T8.AG25T99,ARG,2006,Under Coverage:Students or individuals,Urban areas only.
2,MYS.1T8.AG25T99,ARG,2008,Under Coverage:Students or individuals,Urban areas only.
3,MYS.1T8.AG25T99,ARG,2009,Under Coverage:Students or individuals,Urban areas only.
4,MYS.1T8.AG25T99,ARG,2010,Under Coverage:Students or individuals,Urban areas only.

## PRE-PRIMARY DATA

In [13]:
national_df.head()

  INDICATOR_ID COUNTRY_ID  YEAR  VALUE MAGNITUDE QUALIFIER
0           10        ABW  1998    0.0       NaN       NaN
1           10        ABW  1999    0.0       NaN       NaN
2           10        ABW  2000    0.0       NaN       NaN
3           10        ABW  2001    0.0       NaN       NaN
4           10        ABW  2002    0.0       NaN       NaN

In [14]:
national_df.drop(national_df[national_df["VALUE"] < 1].index, inplace = True)

In [15]:
national_df.drop(["MAGNITUDE", "QUALIFIER"], axis = 1, inplace= True)

In [16]:
national_df.head()

   INDICATOR_ID COUNTRY_ID  YEAR  VALUE
92           10        ALB  2013    1.0
93           10        ALB  2014    1.0
94           10        ALB  2015    1.0
95           10        ALB  2016    1.0
96           10        ALB  2017    1.0

In [17]:
national_df.dtypes

INDICATOR_ID     object
COUNTRY_ID       object
YEAR              int64
VALUE           float64
dtype: object

In [18]:
preprimary_df = national_df[(national_df["INDICATOR_ID"] == "20060")|(national_df["INDICATOR_ID"] == "20061")|(national_df["INDICATOR_ID"] == "20160")|(national_df["INDICATOR_ID"] == "20161")]
preprimary_df.rename(columns={"INDICATOR_ID":"indicator", "COUNTRY_ID":"country_id", "YEAR": "year", "VALUE":"value"}, inplace= True)
pd.options.mode.chained_assignment = None
preprimary_df.shape

(20564, 4)

In [19]:
preprimary_df.isnull().sum()

indicator       0
country_id      0
year            0
value         195
dtype: int64

In [20]:
preprimary_df.dropna(inplace=True)
preprimary_df.reset_index(drop = True, inplace = True)
preprimary_df.shape

(20369, 4)

In [21]:
preprimary_df.isnull().sum()

indicator     0
country_id    0
year          0
value         0
dtype: int64

In [22]:
preprimary_df["indicator"].unique()

array(['20060', '20061', '20160', '20161'], dtype=object)

In [23]:
def classify(id):
        if id == "20060":
            return "Preprimary enrolment(total)"
        
        if id == "20061":
            return "Preprimary enrolment(female)"
        
        if id == "20160":
            return "Preprimary teachers(total)"
        
        return "Preprimary teachers(female)"

In [24]:
pd.set_option('mode.chained_assignment', None)
preprimary_df["indicator"] = preprimary_df["indicator"].apply(classify)

In [25]:
preprimary_df.tail(5)

                         indicator country_id  year    value
20364  Preprimary teachers(female)        ZAF  2014  22706.0
20365  Preprimary teachers(female)        ZWE  1995  12104.0
20366  Preprimary teachers(female)        ZWE  2003  19576.0
20367  Preprimary teachers(female)        ZWE  2012   9495.0
20368  Preprimary teachers(female)        ZWE  2013   9249.0

In [26]:
preprimary_df.shape

(20369, 4)

## POPULATE DATABASE

### Preprimary education

In [27]:
connect = pymysql.connect(host = "localhost", user = "", password= "", database = "unesco")

In [28]:
cursor = connect.cursor()

In [29]:
q1 = """CREATE TABLE total_education_records(id INT NOT NULL AUTO_INCREMENT PRIMARY KEY, indicator VARCHAR(55), country_id VARCHAR(5) NOT NULL, year INT NOT NULL, value INT NOT NULL);"""

In [30]:
cursor.execute(q1)

0

In [31]:
connect.commit()

In [32]:
connect.close()

In [33]:
sql_engine = ('mysql+pymysql://{user}:{pw}@localhost/{db}'.format(user = "",
                                                                  pw = "",
                                                                 db = "unesco"))

In [34]:
preprimary_df.to_sql("total_education_records", con = sql_engine, if_exists = "append", index= False, chunksize = 1000)

### Primary education

In [35]:
primary_df = national_df[(national_df["INDICATOR_ID"] == "20062")|(national_df["INDICATOR_ID"] == "20063")|(national_df["INDICATOR_ID"] == "20162")|(national_df["INDICATOR_ID"] == "20163")]
primary_df.rename(columns={"INDICATOR_ID":"indicator", "COUNTRY_ID":"country_id", "YEAR": "year", "VALUE":"value"}, inplace= True)
primary_df.shape

(27807, 4)

In [36]:
primary_df.isnull().sum()

indicator      0
country_id     0
year           0
value         34
dtype: int64

In [37]:
primary_df.dropna(inplace= True)
primary_df.reset_index(drop = True,inplace = True)
primary_df.shape

(27773, 4)

In [38]:
primary_df.tail()

      indicator country_id  year    value
27768     20163        ZWE  2001  32046.0
27769     20163        ZWE  2002  30062.0
27770     20163        ZWE  2003  31014.0
27771     20163        ZWE  2012  40726.0
27772     20163        ZWE  2013  40718.0

In [39]:
primary_df["indicator"].unique()

array(['20062', '20063', '20162', '20163'], dtype=object)

In [40]:
def classify(id):    
        if id == "20062":
            return "Primary enrolment(total)"
        
        if id == "20063":
            return "Primary enrolment(female)"
        
        if id == "20162":
            return "Primary teachers(total)"
        
        return "Primary teachers(female)"

In [41]:
primary_df["indicator"] = primary_df["indicator"].apply(classify)

In [42]:
primary_df.head()

                  indicator country_id  year   value
0  Primary enrolment(total)        ABW  1999  9096.0
1  Primary enrolment(total)        ABW  2000  9263.0
2  Primary enrolment(total)        ABW  2001  9436.0
3  Primary enrolment(total)        ABW  2002  9840.0
4  Primary enrolment(total)        ABW  2003  9897.0

In [43]:
primary_df.shape

(27773, 4)

In [44]:
primary_df.to_sql("total_education_records", con = sql_engine, if_exists = "append", index= False, chunksize=1000)

### Secondary education

In [45]:
secondary_df = national_df[(national_df["INDICATOR_ID"] == "20064")|(national_df["INDICATOR_ID"] == "20065")|(national_df["INDICATOR_ID"] == "20070")|(national_df["INDICATOR_ID"] == "20071")|(national_df["INDICATOR_ID"] == "20164") |(national_df["INDICATOR_ID"] == "20165") |(national_df["INDICATOR_ID"] == "20170")|(national_df["INDICATOR_ID"] == "20171")]
secondary_df.rename(columns={"INDICATOR_ID":"indicator", "COUNTRY_ID":"country_id", "YEAR": "year", "VALUE":"value"}, inplace= True)
secondary_df.shape

(23101, 4)

In [46]:
secondary_df.dropna(inplace= True)
secondary_df.reset_index(drop = True,inplace = True)
secondary_df.shape

(22269, 4)

In [47]:
secondary_df.head()

  indicator country_id  year   value
0     20064        ABW  1999  2901.0
1     20064        ABW  2000  3059.0
2     20064        ABW  2001  3110.0
3     20064        ABW  2002  3232.0
4     20064        ABW  2003  3214.0

In [48]:
secondary_df["indicator"].unique()

array(['20064', '20065', '20070', '20071', '20164', '20165', '20170',
       '20171'], dtype=object)

In [49]:
label_df.loc[label_df["INDICATOR_ID"]== "20170"]

   INDICATOR_ID                                 INDICATOR_LABEL_EN
24        20170  Teachers in upper secondary education, both se...

In [50]:
def classify(id):    
        if id == "20064":
            return "Lower secondary enrolment(total)"
        
        if id == "20065":
            return "Lower secondary enrolment(female)"
        
        if id == "20070":
            return "Upper secondary enrolment(total)"
        
        if id == "20071":
            return "Upper secondary enrolment(female)"
        
        if id == "20164":
            return "Lower secondary teachers(total)"
        
        if id == "20165":
            return "Lower secondary teachers(female)"
        
        if id == "20170":
            return "Upper secondary teachers(total)"
        
        return "Upper secondary teachers(female)"

In [51]:
secondary_df["indicator"] = secondary_df["indicator"].apply(classify)

In [52]:
secondary_df.to_sql("total_education_records", con = sql_engine, if_exists = "append", index= False, chunksize=1000)

### Tertiary education

In [53]:
tertiary_df = national_df[(national_df["INDICATOR_ID"] == "25053")|(national_df["INDICATOR_ID"] == "25057")|(national_df["INDICATOR_ID"] == "25003")|(national_df["INDICATOR_ID"] == "25007")]
tertiary_df.rename(columns={"INDICATOR_ID":"indicator", "COUNTRY_ID":"country_id", "YEAR": "year", "VALUE":"value"}, inplace= True)
tertiary_df.shape

(18189, 4)

In [54]:
tertiary_df.dropna(inplace= True)
tertiary_df.reset_index(drop = True,inplace = True)
tertiary_df.shape

(18126, 4)

In [55]:
tertiary_df["indicator"].unique()

array(['25003', '25007', '25053', '25057'], dtype=object)

In [56]:
label_df.loc[label_df["INDICATOR_ID"]== "25007"]

   INDICATOR_ID                                 INDICATOR_LABEL_EN
51        25007  Teachers in tertiary education programmes, fem...

In [57]:
def classify(id):    
        if id == "25053":
            return "Tertiary enrolment(total)"
        
        if id == "25057":
            return "Tertiary enrolment(female)"
        
        if id == "25003":
            return "Tertiary teachers(total)"
        
        return "Tertiary teachers(female)"

In [58]:
tertiary_df["indicator"] = tertiary_df["indicator"].apply(classify)

In [59]:
tertiary_df.tail()

                        indicator country_id  year    value
18121  Tertiary enrolment(female)        ZWE  2010  42563.0
18122  Tertiary enrolment(female)        ZWE  2011  40804.0
18123  Tertiary enrolment(female)        ZWE  2012  41406.0
18124  Tertiary enrolment(female)        ZWE  2013  43565.0
18125  Tertiary enrolment(female)        ZWE  2015  64933.0

In [60]:
tertiary_df.to_sql("total_education_records", con = sql_engine, if_exists = "append", index= False, chunksize=1000)

In [61]:
preprimary_df.tail()

                         indicator country_id  year    value
20364  Preprimary teachers(female)        ZAF  2014  22706.0
20365  Preprimary teachers(female)        ZWE  1995  12104.0
20366  Preprimary teachers(female)        ZWE  2003  19576.0
20367  Preprimary teachers(female)        ZWE  2012   9495.0
20368  Preprimary teachers(female)        ZWE  2013   9249.0

In [63]:
preprimary_df.shape

(20369, 4)

In [64]:
primary_df.shape

(27773, 4)

In [65]:
secondary_df.shape

(22269, 4)

In [66]:
tertiary_df.shape

(18126, 4)